[
	[
		{"type": "text", "typing": true, "interval": 3, "value": "**The Lonely wolf**\r\n\r\nAt some god forgotten town in the West, {name} enters a Saloon late in the night. They are welcomed by some cold looks as they make their way to the counter. The bartender, a fat, shit, old and bald man gunching over some glasses that he's wiping comes closer.\r\n\r\n- **\"What's it gonna be tonight\"**\r\n- **\"A glass of juice\"** - replies {name} - **\"I need my energy to get that victory royale tonight xqcL\"**\r\n\r\nThe bartender raises his brow almost in desbielef, however proceeds to open a can of his finest Monster White and pours it on a glass serving it on the counter. {name} grabs the glass and chugs it down without hesitation just like his favorite youtuber BadlandsChugs and then walks to a close table where some shady looking figures are playing a card game on the table. Upon closer inspection he realizes that these people are #gacha addicts and they are betting their live savings to get some weird nude anime girl NFT. Thinking it's an easy score sits down with them and starts playing too."},
		{"type": "text", "typing": true, "interval": 4, "value": "As the next round is about to begin a new figure slams open the doors and storms in. As the light shines over them everyone recognices the figure easily, it's the very powerful local gambler known as Yui. Without any words Yui approaches the table and drops a bag on the table that falls heavily with a *thunk* sound and flips it over, dropping a total of 15 smugs on top of the anime NFT. Everyone open their eyes wide and start rubbing their hands, such a juicy price is only available very rarely and they are willing to go hard for it. However Yui is not yet done, as she moves the cards away from the table and drops a revolver next to the smugs with a single silver bullet.\r\n\r\n- **\"The price for these smugs, is your life. Or for free. Depends on your luck\"** - Yui says with a joyful tone, as she takes a couple of steps back and watches how everyone in the table is still deciding whether to take the shot or not.\r\n\r\n{name} full of Gamer Juice is ready to take the fat W and doesn't hesitate, takes the revolver and loads the silver bullet in it, closing the chamber and rolling it, until it stops and moves the gun to their head..."},
		{"type": "wait", "interval": 5,  "typing": false, "value": ""},
		{"type": "roll", "chances": 6, "win": 4, "lose": 6},
		{"type": "text", "typing": true, "interval": 3, "value": "**CLICK**"},
		{"type": "text", "typing": true, "interval": 3, "end": true, "value": "{name} is sweating, their heart beating fast and hard still rushing from the adrenaline of triggering the revolver but still alive, drops the revolver back on the table and starts gathering the smugs, knowing very soon they will be rich and famous, their bravery and story spreading far and wide in songs and tales to be told. Yui approaches the table and grabs the revolver:\r\n\r\n- **\"You were lucky this time, but don't think this ends here. The pit always beckons its prey.\"** - says before leaving the local."},
		{"type": "text", "typing": true, "interval": 3, "value": "**BANG**"},
		{"type": "text", "typing": true, "interval": 3, "end": true, "value": "{name}'s blood splats all over the floor as their lifeless body drops to the table. Yui smirks and comes closer to the table and collects the smugs and the revolver, turning to look at {name} one last time as her eyes turn red and the shape of the mouth grows a weird black mist:\r\n\r\n- **\"Back to the pit.\"** - says with a deep and demonic voice, before leaving the Saloon satisfied."}
	]
]